// Задание 1 (тайминг 20 минут)
// Текст задания
// 1. Установить расширение форматирования кода
// 2. Установить расширение “JavaScript Snippet Pack”
// 3. Сделайте файл с вашей первой программой.
// a. index.html
// b. script.js
// 4. Подключите файл script.js к index.html
// 5. В файле index.html создайте скрипт который выводит в
// консоль текст “Текст из index.html”
// 6. В файле script.js вывести в консоль текст “Текст из
// script.js!”
console.log("Текст из script.js");

// Задание 2 (тайминг 25 минут)
// Текст задания
// 1. Создайте переменную num и присвойте ей значение 123. Выведите
// значение этой переменной в консоль

let num = 123;
console.log(num);
// 2. Создайте переменную а и присвойте ей значение 5, переопределите
// переменную а на значение 7, выведите переменную а в консоль
let a;
a = 5;
a = 7;
console.log(a);

// 3. Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С
// помощью функции console.log выведите в консоль содержимое
// переменной b.
let b = 1 + 2 + 3;
console.log(b);

// 4. Создайте 2 вида комментариев в вашем коде, добавьте в них
// произвольный текст
// shift+alt+a

// Задание 3 (тайминг 20 минут)
// 1. Создайте переменную c со значением 10 и переменную d со
// значением 2.
const c = 10;
const d = 2;
// a. Все созданные переменные должны быть логично названы
// b. Создайте переменную суммы и присвойте сумму чисел (c,d)
const sum = c + d;
// c. Создайте переменную разности и присвойте разность чисел
// (c,d)
const sub = c - d;

// d. Создайте переменную прозведения и присвойте произведение
// чисел (c,d)
const mult = c * d;

// e. Создайте переменную частного и присвойте деление чисел
// (c,d)
const del = c / d;

// f. Выведите в консоль все созданные переменные
console.log(`Переменные: ${sum}, ${sub}, ${mult}, ${del}`);
// g. Сложите все созданные переменные и выведите результат в
// консоль
const res = sum + sub + mult + del;
console.log(`Результат: ${res}`);

// Задание 5 (тайминг 5 минут)
// 1. Запишите в переменную a число 1.5, а в переменную b - число 0.75.
// Найдите сумму значений этих переменных и выведите ее на экран.
// 2. Создайте переменную a, запишите в нее какое-нибудь
// положительное или отрицательное число. Выведите на экран это
// число с обратным знаком.
